public class Lecture2_Task1 {

/*
    Определение типа переменной является важной задачей, поскольку тип должен отражать ту сущность, которую нужно хранить,
    а также обозначает набор операций над переменной. Например, при работе с математическими операциями лучше выбирать
    численный тип данных вместо строк, даже если в строке содержатся числа, поскольку над строкой математические операции
    выполнить нельзя.

 */

    // Укажите тип для следующих переменных (можно указать все подходящие варианты):

    //Количество кораблей в порту

    //Счетчик целых чисел
    int count;
    //Первое целое число
    int firstN;
    //Случайное целое число
    int randN;
    //Случайное вещественное число
    double randR;
    //Скорость движения автомобиля
    double carSpeed;
    //Введенное пользователем целое число
    int nIn;
    //Наибольшее целое число
    int maxN;
    //Наименьшее вещественное число
    double minR;
    //Левая граница диапазона целых чисел
    int leftN;
    //Правая граница диапазона целых чисел
    int rightN;
    //Загаданное пользователем целое число
    int secretN;
    //Денежный баланс
    double actualMoneyBalance;
    //Количество колес у велосипеда
    int countOfWheels;
    //Голодный ли человек
    boolean hungryMen;
    //Символ латинского алфавита
    char latinChr;
    //Четное ли число
    boolean countable;
    //Текущий год
    int currentYear;
    //Знак пробела
    String space;
    //Стоимость билета
    double ticketCost;

}
