Задание : Описать алгоритмы, с которыми вы сталкиваетесь каждый день.
Кол-во минимум 5.

1.	Приготовление чая:
- прийти на кухню
- взять чайник
- налить в чайник воды
- поставить чайник на плиту
- взять зажигалку
- включить газ и зажечь конфорку
- взять чашку
- поставить чашку на стол
- взять чай
- насыпать чай в чашку
- когда закипит вода в чайнике - взять чайник
- выключить газ
- взять прихватку
- прихваткой поднять чайник 
- налить из чайника воду в чашку с чаем.

2.	Позвонить маме 
- взять телефон
- ввести пин-код
- открыть папку «Контакты»
- найти в папке «Контакты» абонента «Мама» и нажать на него
- нажать вызов
- поднести телефон к уху.

3.	Купить банан
- выйти на улицу
- найти супермаркет
- зайти в супермаркет
- найти островок с фруктами
- взять банан
- отнести его на кассу
- оплатить стоимость банана.

4.	Почистить ботинки
- взять левый грязный ботинок
- взять щетку 
- чистить левый ботинок пока он не станет чистым
- поставить левый ботинок
- взять правый грязный ботинок
- чистить правый ботинок пока он не станет чистым
- поставить правый ботик рядом с левым ботинком
- убрать щетку 

5.	Заменить лампочку
- взять стул
- поставить стул под лампочкой которую нужно заменить
- убедиться что свет выключен
- взять новую лампочку
- встать на стул
- выкрутить старую лампочку
- вкрутить новую лампочку
- слезть со стула
- выбросить старую лампочку
- убрать стул
